{
  "0": "Drinks Food",
  "1": "Life",
  "2": "Subscribe",
  "3": "About",
  "4": "On the Love of Raki and Turkish Food ",
  "5": " ",
  "6": "A little bit of Raki goes a long way. Add a couple ice cubes or water and suddenly its a glory of cloud liquid called \"\"Aslan Sütü\"\"",
  "7": " ",
  "8": "Raki is also a symbol of Turkish culture and hospitality",
  "9": " ",
  "10": " ",
  "11": "Turkish Grill in Sunnyside Queens is a great place to enjoy Raki. It costs only 12 dollars and comes with this elegant and efficient set up. You can also order delicious Turkish dishes",
  "12": "Turkish Grill is located at 4203 Queens Blvd",
  "13": "Learn more about",
  "14": " ",
  "15": "the history of raki here.",
  "16": " ",
  "17": "Checkout Turkish Grill's website",
  "18": " ",
  "19": "here.",
  "20": " ",
  "21": " ",
  "22": " Amaro Montenegro at ZXY Gallery",
  "23": " ",
  "24": "A delicious party.",
  "25": " ",
  "26": " An Awkward Quest",
  "27": " ",
  "28": "For a Funky Natural Red",
  "29": " ",
  "30": " On the Love of Loose Tea",
  "31": "Especially the MIA airport location\"",
  "32": "Create Next App\nDrinks Food\n Life\nSubscribe\nAbout\nSummer Cocktails pt.2: Grand Army Punch\nby @chemixtry\n \nSummer has indeed hit us with some heat. A good sherry elixer for all this sun and humidity is a delicious cocktail by @chemixtry.\n \nGrand Army Punch In 1883, Rochester, NY bartender, Patrick H. \"Patsy\" McDonough published this recipe specifically to celebrate the Grand Army of the Republic in observance of Memorial Day; some of whom were his personal friends and acquaintances fighting for the Union in the Civil War. \nFor 1 serving of his Grand Army Punch:\n1 oz cognac\n1 oz oloroso sherry\n1 oz white dessert wine\n3 oz champagne\n0.5 oz lemon juice\nOleo Saccharum from previous recipe ~0.5 oz\nPineapple rings, orange and lemon slices\nYou could really do almost anything with an oleo saccharum. Keep it simple and pour some good gin or rum over it. But don't forget the ice!\nCheckout\n \nChemixtry's\n \ninstagram for more cocktail ideas. They have a ton of drink recipes to try.\n \n Amaro Montenegro at ZXY Gallery\n \nA delicious party.\n \n An Awkward Quest\n \nFor a Funky Natural Red\n \n On the Love of Loose Tea\nEspecially the MIA airport location",
  "33": "Create Next App\nDrinks Food\n Life\nSubscribe\nAbout\nLooking to add some pop to your website? Let us help you! Email us at drinksfoodlife@gmail.com or contact us on instagram @drinksfoodlife\nFounded with the desire to focus on drinks and food, but then life in its most general yet effervescent spirit came through. On came the articles on Frida, on Botanical Gardens, on Skiing, and even on Spear Fishing!\nWe have had contributions from @chemixtry, @journeyswithjaphe , Loic Luspo, @omlettehoe, @cosmicveggie and others.\nPlease follow us on Instagram\n \nHERE\n \n Amaro Montenegro at ZXY Gallery\n \nA delicious party.\n \n An Awkward Quest\n \nFor a Funky Natural Red\n \n On the Love of Loose Tea\nEspecially the MIA airport location",
  "34": "Create Next App\nDrinks Food\n Life\nSubscribe\nAbout\nIn Love with North Dumpling in Dimes Square\n \n \nNorth Dumpling you are the most beautiful dumpling spot and you dont even know it. I follow the directions for your frozen dumplings that you pasted on to the glass display next to the spring rolls seemingly years ago. Eternal endless bliss pours through your dumplings. Bountiful is the vitality of the owners ps.\n \nAs a fan of authentic Chinese cuisine, I can confidently say that North Dumpling is the best dumpling spot in the Lower East Side. I follow the directions for your frozen dumplings that you pasted on to the glass display next to the spring rolls seemingly years ago. With each succulent bite of these homemade dumplings, I am transported to a realm of eternal, endless bliss, where the flavors of Asia come alive.\n \nLocated on Essex St, North Dumpling is a true gem in the local food scene of NYC. The Chinese-style dumplings are a beloved staple of this city's cuisine, and North Dumpling's take on them is simply unmatched. Whether you're a seasoned dumpling enthusiast or new to the game, these frozen dumplings are a must-try.\n \nAnd let us not forget the vitality of your owners, whose passion for creating the perfect dumpling is evident in every morsel. Their dedication to preserving the flavors and traditions of Chinese cuisine is truly admirable. Thank you for being a part of the vibrant food culture of the Lower East Side, North Dumpling.\n \n Amaro Montenegro at ZXY Gallery\n \nA delicious party.\n \n An Awkward Quest\n \nFor a Funky Natural Red\n \n On the Love of Loose Tea\nEspecially the MIA airport location",
  "35": "Create Next App\nDrinks Food\n Life\nSubscribe\nAbout\nDrinking Amaro Montenegro at ZXY Gallery\nZXY Gallery and Drinks...Food...Life! teamed up for Art pop up that featured an Amaro Montenegro tasting on the rooftop of ZXY Gallery in Bushwick. The rest was history. Insert upside down smiley face here. Loic Luspo, french model and professional handball athlete, models for the photo.\nZXY Gallery is located by the Williamsburg and Bushwick border. Cosmic Veggie is a curatorial platform that focuses on art experiences paired with food and drinks.\nCheck out their instagram for more info \nhere\nFor more on Amaro Montenegro visit \nwww.amaromontenegro.com\n \n Amaro Montenegro at ZXY Gallery\n \nA delicious party.\n \n An Awkward Quest\n \nFor a Funky Natural Red\n \n On the Love of Loose Tea\nEspecially the MIA airport location",
  "36": "Create Next App\nDrinks Food\n Life\nSubscribe\nAbout\nAn Awkward Question about Natural Wine \nAn awkward question is posed, “hey...there...I'm looking for a ...natural wine...something funky...that isn’t going to cost over twenty five dollars?”\nIf you are like me, then your normal speaking voice is ridden with pauses so as to humbly point out a lack of certainty. Luckily, the people at\n \nIrving Bottle\n \nare prepared for this. When it comes to the new movement of natural wines, one could say the whole movement should be speaking in such a tone. A movement that is clearly going to gain steam in 2019, natural wines do not come with a specific certification one has to pay for necessarily, like a wine that is certified organic or biodynamic for example and thus, the definition of natural is open to interpretation.\nWhile the question of what makes a wine natural is clearly an interesting one, another great question is: why is everybody freaking out over natural wines? There are several good answers to that question. You could answer that question by mentioning all the nods to minimalism that comes with natural wine like the lack of or minimal use of sulfites, lack of advanced technology, or lack of filtration. Another way you could answer that question would be to mention how natural wine uses more old school techniques in the wine making process. Lets not forget all the cool labels they come with, boutique distributors, stores, and restaurants all dedicated to natural wine. However, none of these are the best reasons to freak out about natural wine.\nWhat is the best reason? The unique funky taste. When I awkwardly asked an employee at Irving Bottle, located on...Irving Ave (who would have guessed???) in Bushwick Brooklyn, if they had a funky yet affordable natural red, I was delighted to find out that this neighborhood gem did indeed carry an array of such wines. The wine they suggested to me was the Coup de Canon produced by Gregory Leclerc of Domaine Chahut et Prodiges located in the Loire Valley.\n \n Amaro Montenegro at ZXY Gallery\n \nA delicious party.\n \n An Awkward Quest\n \nFor a Funky Natural Red\n \n On the Love of Loose Tea\nEspecially the MIA airport location",
  "37": "Create Next App\nDrinks Food\n Life\nSubscribe\nAbout\n5 Reasons Why You Should Drink Loose Teas\n \nLots to say about the tea in its loosest form and genmaicha...and Porto Rico Importing Company which dates back to 1907. Here are 5 reasons why loose tea is great!\nLots of flavor:\n Loose tea leaves are larger and less processed than tea found in bags, which means they retain more of their natural oils and flavor.\nHigher quality:\n Loose tea is often made from better quality tea leaves compared to the broken leaves and dust found in tea bags.\nHealth benefits:\n Loose tea contains antioxidants, polyphenols, and other beneficial compounds that can help support overall health and well-being.\nCustomizable:\n Loose tea allows for more control over the strength and flavor of your tea. You can adjust the amount of tea leaves and steeping time to your liking.\nEco-friendly:\n Loose tea generates less waste than tea bags, which are often made with non-biodegradable materials like nylon or polyester.\n \n Amaro Montenegro at ZXY Gallery\n \nA delicious party.\n \n An Awkward Quest\n \nFor a Funky Natural Red\n \n On the Love of Loose Tea\nEspecially the MIA airport location\nContact us cause this is now the footer",
  "38": "Create Next App\nDrinks Food\n Life\nSubscribe\nAbout\nThe Best Tacos in BK\nWe did a poll of the best tacos spots in BK and the results were very close. There was a write-in for Taqueria Ramirez, which has us wondering if we need to do another poll! It’s always exciting to discover new places that serve delicious tacos. We value the opinions of our followers and would love to hear more about their favorite taco spots in BK. Hit us up on Instagram to let us know what you think.",
  "39": "Create Next App\nDrinks Food\n Life\nSubscribe\nAbout\n \nOn Art and Spear Fishing \n \nNicole Burko caught a fish free diving in the depths of the Atlantic like a ferocious predator, but photos of her submerged laying in wait at the bottom of the sea are more precious and beautiful than anything else. How nice it is to know that this blackened strip bass came from the hands of a friend, Nicole Burko.\nCheck out her art here @nicoleburko on instagram    . Also noteworthy, fried plantains forever, pescatarian vibes, and new favourite green --> Baby Kale. Not that I don’t love my arugula and red lettuce, but that baby kale has the cutest name of the leafy greens that I know of. Is their cuter leafy green competition?\nNicole is also an accomplished painter. She earned an MFA at Columbia is painting and has shown with\n \nZXY Gallery\n \namongst many other prestigious galleries.\n \n Amaro Montenegro at ZXY Gallery\n \nA delicious party.\n \n An Awkward Quest\n \nFor a Funky Natural Red\n \n On the Love of Loose Tea\nEspecially the MIA airport location",
  "40": "Create Next App\nDrinks Food\n Life\nSubscribe\nAbout\nAwe and Culture in Aspen: Whispering Angel Rose \nAspen combines transcendental meaning with a stylish gluttony. If you are going to treat yourself, why not just go all the way, but if you are trying to do it in a cost effective way that's another story.\nStyle can be defined as a way of doing things or appearing. One doesn't haaave to pay a lot of money to be stylish or a glutton, but it's pretty hard to avoid it in Aspen.\nHowever, if you are able to plan ahead and buy a multi-day pass. You can find yourself skiing in one of the best mountains in the US if not the world in one of the ski world's most famous locations. Not only that, if you go to Bonnie's for lunch, you can get yourself and a friend a delicious bottle of Whispering Angel Rose for only 45 dollars.\nLooking for a winter sports destination that offers both luxurious amenities and cost-effective options? Aspen might be just what you're looking for. With its reputation for stylish gluttony, Aspen certainly has plenty of high-end dining options and luxurious accommodations. However, these amenities can come at a high cost, making it difficult for travelers on a budget to fully enjoy all that Aspen has to offer.\nOn the other hand, Aspen does offer some cost-effective options for those who plan ahead, such as purchasing a multi-day pass or finding affordable dining options. And with its four mountains, including Aspen Mountain and Snowmass, visitors can experience some of the best ski slopes in the world. Additionally, Aspen boasts world-class spas and resorts, making it a great destination for those who want to relax and unwind after a day on the slopes.\nAspen's natural beauty, stunning scenery, and awe-inspiring landscapes can provide a sense of transcendental meaning for some visitors. The feeling of being surrounded by the majestic Rocky Mountains, the crisp mountain air, and the serene wilderness can inspire a sense of awe and wonder, connecting visitors to something greater than themselves.\nLearn more about\n \nthe Rose\n \nhere.\n \n Amaro Montenegro at ZXY Gallery\n \nA delicious party.\n \n An Awkward Quest\n \nFor a Funky Natural Red\n \n On the Love of Loose Tea\nEspecially the MIA airport location",
  "41": "Create Next App\nDrinks Food\n Life\nSubscribe\nAbout\nBaby Daddy Please \n \nBaby Daddy is a great choice for anyone that wants a highly drinkable beer that is full of flavor. With so many styles of beer available it's easy to make an appreciative glance at the noticeably hip design of baby daddy and then get distracted by some other beer in the vast array of beers in the world. Ahh...so many tasty beer fish in the sea.\nIndeed, the anonymity of any beer on the shelf in a major city in the US is akin to the modern era of dating. With so many IPAs (not to mention session IPAs) on the market, it’s easy to swipe left on any beer these days, but Baby Daddy seems to be having more success than the rest of the flock these days.\nThe good tidings have most likely arisen because of the full-bodied IPA taste with a very noticeable grapefruit kick that is still incredibly easy to drink. A quality product coupled with cool packaging and branding that is emblematic of Speakeasy ales and lagers ensures Baby Daddy IPA will be a bevy daddies, mommies, and the whole over 21-year-old family will be enjoying for a long time. Cheers!\n \n Amaro Montenegro at ZXY Gallery\n \nA delicious party.\n \n An Awkward Quest\n \nFor a Funky Natural Red\n \n On the Love of Loose Tea\nEspecially the MIA airport location",
  "42": "Create Next App\nDrinks Food\n Life\nSubscribe\nAbout\nOn the Love of Mole at Meson Antugua Santa Catarina \nI love Mole. You can get it in dry form at the market in\n \nCoyoacan\n \nor you can get it in mousse form at the Meson Antigua Santa Catarina which is right next to the Parque Santa Catarina. It also comes with a cute apple shaped duck. Nuff said, but here are 7 additional reasons why you should love Mole and Meson Antigua Santa Catarina:\nMole is a versatile sauce that can be used to enhance the flavor of many different dishes, including chicken, pork, and vegetables.\nThe Meson Antigua Santa Catarina has a wide selection of other traditional Mexican dishes, allowing you to explore the cuisine and try new things.\nThe restaurant offers a great selection of drinks to complement your meal, including margaritas and Mexican beers.\nThe Meson Antigua Santa Catarina is housed in a charming historic building, giving the restaurant a unique and authentic feel.\nThe staff at the Meson Antigua Santa Catarina are friendly and knowledgeable about the menu, and can help you find the perfect dish to suit your taste.\nThe mole at the Meson Antigua Santa Catarina is made using traditional techniques and high-quality ingredients, ensuring that you get an authentic and delicious experience.\nVisiting the Meson Antigua Santa Catarina is a great way to experience the rich cultural heritage of Mexico, and to learn more about the history and traditions of Mexican cuisine.\n \n Amaro Montenegro at ZXY Gallery\n \nA delicious party.\n \n An Awkward Quest\n \nFor a Funky Natural Red\n \n On the Love of Loose Tea\nEspecially the MIA airport location",
  "43": "Create Next App\nDrinks Food\n Life\nSubscribe\nAbout\nGetting Deep in Coyoacan \nI love Coyoacan. I love Frida Kahlo. What a lovely way to spend the day, visiting the Blue House and the market in Coyoacan! It was also a deeply emotional experience. Having visited a flower-filled graveyard nearby. I was struck by the living flower plants growing amongst freshly laid flowers soon to dry juxtaposed to signs on the graves that would feature sad laments at death and loss. After all of that, I was ready for some\n \nmole\n \n Amaro Montenegro at ZXY Gallery\n \nA delicious party.\n \n An Awkward Quest\n \nFor a Funky Natural Red\n \n On the Love of Loose Tea\nEspecially the MIA airport location",
  "44": "Create Next App\nDrinks Food\n Life\nSubscribe\nAbout\nWriting Away Your Sunny Days at Sea Wolf \nTasty happy hour oysters …Noted. You will have a lot of fun enjoying a beautiful day in Bushwick working on some writing at Sea Wolf 🐺. Sea Wolf reigns as one of the premiere locations to breathe fresh air while you eat or drink tasty things.\nA solid happy hour and a diverse menu are also big bonuses. Come for the people watching right by the Jefferson L stop. Stay for the oysters.\n \n \nIf you're looking for a unique dining experience in Bushwick, Sea Wolf is a must-visit destination. The restaurant offers a cozy and inviting atmosphere, making it perfect for a casual dinner or a night out with friends. Their menu is filled with a variety of options, including fresh seafood, vegetarian dishes, and handcrafted cocktails. With their commitment to using locally-sourced ingredients and their attention to detail, Sea Wolf has quickly become a favorite among locals and visitors alike. Whether you're stopping by for happy hour or enjoying a full meal, Sea Wolf is sure to leave a lasting impression.\nCheckout\n \nSea Wolf\n \nfor more info. They have a lot of fun events and promos that keep one wanting all their food and drinks.\n \n \n Amaro Montenegro at ZXY Gallery\n \nA delicious party.\n \n An Awkward Quest\n \nFor a Funky Natural Red\n \n On the Love of Loose Tea\nEspecially the MIA airport location",
  "45": "Create Next App\nDrinks Food\n Life\nSubscribe\nAbout\nNaples Botanical Garden Welcomes Frida and the Casa Azul \n \nThe Frida Kahlo Exhibit at the\n \nNaples Botanical Garden\n \nis a unique display of Mexican culture, art, and nature. The exhibit showcases replicas from Frida Kahlo's Casa Azul, her garden, and the plants of Mexico, all of which were central to Kahlo's life and art. THE exhibit displays much of her personal style and portrayal of Mexican culture. The Casa Azul, where she was born and raised, is now a museum in Mexico City that houses her personal belongings, artwork, and a collection of Mexican folk art.\nThe Naples Botanical Garden's Frida Exhibit features replicas of some of Kahlo's most iconic works, including her self-portraits, her famous portraits of Diego Rivera, and her paintings of Mexican culture and nature. The exhibit also includes replicas of Kahlo's personal belongings, such as her traditional Mexican dresses, her jewelry, and her household items. One of the most impressive aspects of the exhibit is the recreation of Kahlo's garden. The garden was a vital part of Kahlo's life, and she spent countless hours tending to it, planting new species of plants and flowers and creating beautiful arrangements. The garden was also a source of inspiration for many of her paintings, including her famous painting, \"The Two Fridas.\"\nThe Naples Botanical Garden's replica of Kahlo's garden includes a variety of plants and flowers that were native to Mexico, such as marigolds, dahlias, and Mexican sunflowers. The garden is arranged in a way that mirrors the layout of Kahlo's original garden, with paths lined with stones and pots filled with brightly colored flowers. The exhibit also features a collection of plants from Mexico that were important to Kahlo, including the agave plant, which is used to make tequila, and the prickly pear cactus, which was a staple food source for the indigenous people of Mexico. These plants are not only beautiful, but they also offer visitors a glimpse into the culture and history of Mexico.\nLearn more about\n \nthe Casa Azul\n \nhere.\n \n \n Amaro Montenegro at ZXY Gallery\n \nA delicious party.\n \n An Awkward Quest\n \nFor a Funky Natural Red\n \n On the Love of Loose Tea\nEspecially the MIA airport location"
}