{
  "0": "A little bit of Raki goes a long way. Add a couple of ice cubes or water, and suddenly it’s a glory of cloud liquid called 'Aslan Sütü,' meaning 'Lion’s Milk.' It still has that strong anise taste, which is said to inspire power and bravery. All of these things make it a great digestif or first drink. Raki is also a symbol of Turkish culture and hospitality, often served with meze and enjoyed similarly to sharing a bottle of wine with friends. Turkish Grill in Sunnyside, Queens, is a great place to enjoy Raki. It costs only $12 and comes with this elegant and efficient setup. You can also order delicious Turkish dishes such as kebabs, manti, lahmacun, and baklava to pair with your drink. The restaurant has a fun and cozy atmosphere, with attentive staff and authentic decor. Turkish Grill is open every day from 11:30 am to 10:30 pm (11:00 pm on weekends), and you can order online or make a reservation. Turkish Grill is located at 4203 Queens Blvd, Sunnyside, NY 11104. Learn more about the history of Raki here. Checkout Turkish Grill's website here.",
  "1": " ",
  "4": "Summer Cocktails pt.2: Grand Army Punch by @chemixtry Summer has indeed hit us with some heat. A good sherry elixer for all this sun and humidity is a delicious cocktail by @chemixtry.",
  "5": " ",
  "6": "Grand Army Punch In 1883",
  "7": "For 1 serving of his Grand Army Punch:",
  "8": "1 oz cognac",
  "9": "1 oz oloroso sherry",
  "10": "1 oz white dessert wine",
  "11": "3 oz champagne",
  "12": "0.5 oz lemon juice",
  "13": "Oleo Saccharum from previous recipe ~0.5 oz",
  "14": "Pineapple rings",
  "15": "You could really do almost anything with an oleo saccharum. Keep it simple and pour some good gin or rum over it. But don't forget the ice!",
  "16": "Checkout",
  "17": " ",
  "18": "Chemixtry's",
  "19": " ",
  "20": "instagram for more cocktail ideas. They have a ton of drink recipes to try.",
  "21": " ",
  "23": "Looking to add some pop to your website? Let us help you! Email us at drinksfoodlife@gmail.com or contact us on instagram @drinksfoodlife",
  "24": "Founded with the desire to focus on drinks and food",
  "25": "We have had contributions from @chemixtry",
  "26": "Please follow us on Instagram",
  "27": " ",
  "28": "HERE",
  "29": " ",
  "33": "In Love with North Dumpling in Dimes Square",
  "34": " ",
  "35": " ",
  "36": "North Dumpling you are the most beautiful dumpling spot and you dont even know it. I follow the directions for your frozen dumplings that you pasted on to the glass display next to the spring rolls seemingly years ago. Eternal endless bliss pours through your dumplings. Bountiful is the vitality of the owners ps.",
  "37": " ",
  "38": "As a fan of authentic Chinese cuisine",
  "39": " ",
  "40": "Located on Essex St",
  "41": " ",
  "42": "And let us not forget the vitality of your owners",
  "43": " ",
  "44": " ",
  "45": " ",
  "46": " ",
  "47": " ",
  "48": " ",
  "52": "Drinking Amaro Montenegro at ZXY Gallery",
  "53": "ZXY Gallery and Drinks...Food...Life! teamed up for Art pop up that featured an Amaro Montenegro tasting on the rooftop of ZXY Gallery in Bushwick. The rest was history. Insert upside down smiley face here. Loic Luspo",
  "54": "ZXY Gallery is located by the Williamsburg and Bushwick border. Cosmic Veggie is a curatorial platform that focuses on art experiences paired with food and drinks.",
  "55": "Check out their instagram for more info ",
  "56": "here",
  "57": "For more on Amaro Montenegro visit ",
  "58": "www.amaromontenegro.com",
  "61": "An Awkward Question about Natural Wine ",
  "62": "An awkward question is posed",
  "63": "If you are like me",
  "64": " ",
  "65": "Irving Bottle",
  "66": " ",
  "67": "are prepared for this. When it comes to the new movement of natural wines",
  "68": "While the question of what makes a wine natural is clearly an interesting one",
  "69": "What is the best reason? The unique funky taste. When I awkwardly asked an employee at Irving Bottle",
  "70": " ",
  "74": "5 Reasons Why You Should Drink Loose Teas",
  "75": " ",
  "76": "Lots to say about the tea in its loosest form and genmaicha...and Porto Rico Importing Company which dates back to 1907. Here are 5 reasons why loose tea is great!",
  "77": "Lots of flavor:",
  "78": " Loose tea leaves are larger and less processed than tea found in bags",
  "79": "Higher quality:",
  "80": " Loose tea is often made from better quality tea leaves compared to the broken leaves and dust found in tea bags.",
  "81": "Health benefits:",
  "82": " Loose tea contains antioxidants",
  "83": "Customizable:",
  "84": " Loose tea allows for more control over the strength and flavor of your tea. You can adjust the amount of tea leaves and steeping time to your liking.",
  "85": "Eco-friendly:",
  "86": " Loose tea generates less waste than tea bags",
  "87": " ",
  "88": " ",
  "89": " ",
  "90": " ",
  "91": " ",
  "92": " ",
  "93": "Especially the MIA airport location",
  "94": "Contact us cause this is now the footer\"",
  "97": "The Best Tacos in BK",
  "98": "We did a poll of the best tacos spots in BK and the results were very close. There was a write-in for Taqueria Ramirez",
  "101": " ",
  "102": "On Art and Spear Fishing ",
  "103": " ",
  "104": "Nicole Burko caught a fish free diving in the depths of the Atlantic like a ferocious predator",
  "105": "Check out her art here @nicoleburko on instagram    . Also noteworthy",
  "106": "Nicole is also an accomplished painter. She earned an MFA at Columbia is painting and has shown with",
  "107": " ",
  "108": "ZXY Gallery",
  "109": " ",
  "110": "amongst many other prestigious galleries.",
  "111": " ",
  "116": "Awe and Culture in Aspen: Whispering Angel Rose ",
  "117": "Aspen combines transcendental meaning with a stylish gluttony. If you are going to treat yourself",
  "118": "Style can be defined as a way of doing things or appearing. One doesn't haaave to pay a lot of money to be stylish or a glutton",
  "119": "However",
  "120": "Looking for a winter sports destination that offers both luxurious amenities and cost-effective options? Aspen might be just what you're looking for. With its reputation for stylish gluttony",
  "121": "On the other hand",
  "122": "Aspen's natural beauty",
  "123": "Learn more ",
  "124": " ",
  "125": "the Rose",
  "126": " ",
  "127": "here.",
  "130": "Baby Daddy Please ",
  "131": " ",
  "132": "Baby Daddy is a great choice for anyone that wants a highly drinkable beer that is full of flavor. With so many styles of beer available it's easy to make an appreciative glance at the noticeably hip design of baby daddy and then get distracted by some other beer in the vast array of beers in the world. Ahh...so many tasty beer fish in the sea.",
  "133": "Indeed",
  "134": "The good tidings have most likely arisen because of the full-bodied IPA taste with a very noticeable grapefruit kick that is still incredibly easy to drink. A quality product coupled with cool packaging and branding that is emblematic of Speakeasy ales and lagers ensures Baby Daddy IPA will be a bevy daddies",
  "135": " ",
  "136": "On the Love of Mole at Meson Antugua Santa Catarina ",
  "137": "I love Mole. You can get it in dry form at the market in",
  "138": " ",
  "139": "Coyoacan",
  "140": " ",
  "141": "or you can get it in mousse form at the Meson Antigua Santa Catarina which is right next to the Parque Santa Catarina. It also comes with a cute apple shaped duck. Nuff said",
  "142": "Mole is a versatile sauce that can be used to enhance the flavor of many different dishes",
  "143": "The Meson Antigua Santa Catarina has a wide selection of other traditional Mexican dishes",
  "144": "The restaurant offers a great selection of drinks to complement your meal",
  "145": "The Meson Antigua Santa Catarina is housed in a charming historic building",
  "146": "The staff at the Meson Antigua Santa Catarina are friendly and knowledgeable about the menu",
  "147": "The mole at the Meson Antigua Santa Catarina is made using traditional techniques and high-quality ingredients",
  "148": "Visiting the Meson Antigua Santa Catarina is a great way to experience the rich cultural heritage of Mexico",
  "149": " ",
  "152": "Getting Deep in Coyoacan ",
  "153": "I love Coyoacan. I love Frida Kahlo. What a lovely way to spend the day",
  "154": "Writing Away Your Sunny Days at Sea Wolf ",
  "155": "Tasty happy hour oysters …Noted. You will have a lot of fun enjoying a beautiful day in Bushwick working on some writing at Sea Wolf 🐺. Sea Wolf reigns as one of the premiere locations to breathe fresh air while you eat or drink tasty things.",
  "156": "A solid happy hour and a diverse menu are also big bonuses. Come for the people watching right by the Jefferson L stop. Stay for the oysters.",
  "157": " ",
  "158": "If you're looking for a unique dining experience in Bushwick",
  "159": "Checkout Sea Wolf for more info. They have a lot of fun events and promos that keep one wanting all their food and drinks. ",
  "160": "Naples Botanical Garden Welcomes Frida and the Casa Azul ",
  "161": " ",
  "162": "The Frida Kahlo Exhibit at the",
  "163": " ",
  "164": "Naples Botanical Garden",
  "165": " ",
  "166": "is a unique display of Mexican culture",
  "167": "The Naples Botanical Garden's Frida Exhibit features replicas of some of Kahlo's most iconic works",
  "168": "The Naples Botanical Garden's replica of Kahlo's garden includes a variety of plants and flowers that were native to Mexico",
  "169": "Learn more the Casa Azul here.",
  "170": " "
}